Тестовая_база_ERP_14/src/Catalogs/КатегорииЭксплуатации/КатегорииЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииЭксплуатации</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИнвентарныйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПогашенияСтоимостиБУ</name>
    <type>
      <types>EnumRef.СпособыПогашенияСтоимостиТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемНаработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияНаработки</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗабалансовогоУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПогашенияСтоимостиНУ</name>
    <type>
      <types>EnumRef.СпособыПогашенияСтоимостиТМЦ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Enums/СпособыПогашенияСтоимостиТМЦ/СпособыПогашенияСтоимостиТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПогашенияСтоимостиТМЦ</name>
  <enumValues>
    <name>ПриПередаче</name>
  </enumValues>
  <enumValues>
    <name>ПоСроку</name>
  </enumValues>
  <enumValues>
    <name>ПоНаработке</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/ВидыСчетовРеглУчета/ВидыСчетовРеглУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСчетовРеглУчета</name>
  <enumValues>
    <name>АвансыВыданные</name>
  </enumValues>
  <enumValues>
    <name>АвансыПолученные</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродаж</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродажКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>Доходы</name>
  </enumValues>
  <enumValues>
    <name>НаСкладе</name>
  </enumValues>
  <enumValues>
    <name>НДСпоПриобретеннымЦенностям</name>
  </enumValues>
  <enumValues>
    <name>НДСПриДоходах</name>
  </enumValues>
  <enumValues>
    <name>НДСПриЗакупке</name>
  </enumValues>
  <enumValues>
    <name>НДСПриОтгрузкеБезПереходаПраваСобственности</name>
  </enumValues>
  <enumValues>
    <name>НДСПриПродаже</name>
  </enumValues>
  <enumValues>
    <name>НДСПриПродажеКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>РеализацияБезПереходаПраваСобственности</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеОперации</name>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
  </enumValues>
  <enumValues>
    <name>РасходыМЦ</name>
  </enumValues>
  <enumValues>
    <name>УдалитьРасчетыПоВознаграждению</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоПодарочнымСертификатам</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоПретензиям</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентами</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКлиентамиТара</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПоставщиками</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПоставщикамиТара</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродаж</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродажКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>ТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ТМЦВЭксплуатацииЗаБалансом</name>
  </enumValues>
  <enumValues>
    <name>СписаниеРасходовОСНО</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеАктивыПассивы</name>
  </enumValues>
  <enumValues>
    <name>СписаниеРасходовЕНВД</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредства</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияВНА</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияВНА_ЦФ</name>
  </enumValues>
  <enumValues>
    <name>ВыбытиеВНА</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьВНА</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьВНА_ЦФ</name>
  </enumValues>
  <enumValues>
    <name>РезервДоОценкиВНА</name>
  </enumValues>
  <enumValues>
    <name>ЗабалансовыйУчетВНА</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКредиторамиОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКредиторамиКомиссия</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСКредиторамиПроценты</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСДебиторамиОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСДебиторамиКомиссия</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСДебиторамиПроценты</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтПродажЕНВД</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродажЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ЗатратыНаПриобретениеТМЦ</name>
  </enumValues>
  <enumValues>
    <name>НеотфактурованныеПоставки</name>
  </enumValues>
  <enumValues>
    <name>Резервы</name>
  </enumValues>
  <enumValues>
    <name>ЛизинговыеУслуги</name>
  </enumValues>
  <enumValues>
    <name>ОбеспечительныйПлатежПоЛизингу</name>
  </enumValues>
  <enumValues>
    <name>ВыкупПредметаЛизинга</name>
  </enumValues>
  <enumValues>
    <name>АрендныеОбязательстваПоЛизингу</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Catalogs/КатегорииЭксплуатации/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьРеглУчет") Тогда
		
		НепроверяемыеРеквизиты.Добавить("СпособПогашенияСтоимостиБУ");
		НепроверяемыеРеквизиты.Добавить("СпособПогашенияСтоимостиНУ");
		НепроверяемыеРеквизиты.Добавить("ЕдиницаИзмеренияНаработки");
		НепроверяемыеРеквизиты.Добавить("ОбъемНаработки");
		//++ НЕ УТ
	Иначе
		Если ИнвентарныйУчет=Истина И СпособПогашенияСтоимостиБУ = Перечисления.СпособыПогашенияСтоимостиТМЦ.ПоНаработке Тогда
			НепроверяемыеРеквизиты.Добавить("СрокЭксплуатации");
		Иначе
			НепроверяемыеРеквизиты.Добавить("ЕдиницаИзмеренияНаработки");
			НепроверяемыеРеквизиты.Добавить("ОбъемНаработки");
		КонецЕсли;
		//-- НЕ УТ
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Отказ ИЛИ ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//++ НЕ УТ
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРеглУчет") Тогда
		ВидыСчетаДляОчистки = Новый Массив;
		Если ЗначениеЗаполнено(СчетУчета) Тогда
			ВидыСчетаДляОчистки.Добавить(Перечисления.ВидыСчетовРеглУчета.ТМЦВЭксплуатации);
		КонецЕсли;
		Если ЗначениеЗаполнено(СчетЗабалансовогоУчета) Тогда
			ВидыСчетаДляОчистки.Добавить(Перечисления.ВидыСчетовРеглУчета.ТМЦВЭксплуатацииЗаБалансом);
		КонецЕсли;
		Если ВидыСчетаДляОчистки.Количество() Тогда
			РегистрыСведений.СчетаРеглУчетаТребующиеНастройки.ОчиститьПриЗаписиАналитикиУчета(Ссылка, ВидыСчетаДляОчистки);
		КонецЕсли;
	КонецЕсли;
	//-- НЕ УТ
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
